---
kind: type
id: T:Autodesk.Revit.DB.Visual.WallPaint
source: html/0eec978d-2f3f-e02d-32c8-082434311042.htm
---
# Autodesk.Revit.DB.Visual.WallPaint

A static class that provides access to the property names that appear in the WallPaint visual asset schema.

## Syntax (C#)
```csharp
public static class WallPaint
```